In [2]:
import pandas as pd
import re

In [3]:
df = pd.read_excel('scores draft.xlsx')

### Drop a column or columns
* <b>.drop(columns='a colname')</b><br />
> or<br />
* <b>.drop(columns=[colname list])</b><br />

In [4]:
df.drop(columns='序號', inplace=True)

In [5]:
df.head(3)

    魏   石   李
0  70  65  77
1  85  79  86
2  81  75  83

### makes dataframe's index start from 1

In [6]:
df.index+=1

In [7]:
df.head(3)

    魏   石   李
1  70  65  77
2  85  79  86
3  81  75  83

### get column names

In [8]:
cols=df.columns

### get DataFrame's dimension and shape

In [11]:
len(df)

32

In [9]:
df.shape

(32, 3)

### subtract two columns, and add it to a new column

In [122]:
for i in range(len(cols)-1):
    for j in range(i+1, len(cols)):
        try:
             df['|'+cols[i]+'-'+cols[j]+'|']=abs(df.iloc[:, i]-df.iloc[:, j])    
        except:
             print(i, j)

In [123]:
df.head()

    魏   石   李  |魏-石|  |魏-李|  |石-李|
1  70  65  77      5      7     12
2  85  79  86      6      1      7
3  81  75  83      6      2      8
4  86  77  86      9      0      9
5  89  77  79     12     10      2

### aggregate all rows that fulfils filtering conditions
- remove duplicates
- sort by index

In [124]:
resdf=pd.DataFrame()
for i in range(len(cols)-1):
    for j in range(i+1, len(cols)):
        resdf=pd.concat([
            resdf, df[df['|'+cols[i]+'-'+cols[j]+'|']>=15]
        ])
resdf=resdf.drop_duplicates().sort_index()

In [125]:
resdf

     魏   石   李  |魏-石|  |魏-李|  |石-李|
7   47  66  74     19     27      8
14  63  75  78     12     15      3
24  49  64  74     15     25     10
28  68  61  76      7      8     15
31  73  69  85      4     12     16

### get similarities between two columns
- cosine
- rmse

In [126]:
from numpy import dot, sqrt, mean
from numpy.linalg import norm

def cosine(v1, v2):
    return dot(v1, v2)/norm(v1)/norm(v2)

def rmse(v1, v2):
    return sqrt(mean((v1-v2)**2))

In [127]:
for i in range(len(cols)-1):
    for j in range(i+1, len(cols)):
        print(cosine(df.iloc[:, i], df.iloc[:, j]))

0.9951053353378969
0.994412407431916
0.9986403156968542

In [128]:
for i in range(len(cols)-1):
    for j in range(i+1, len(cols)):
        print(rmse(df.iloc[:, i], df.iloc[:, j]))

8.455767262643882
8.739279146474267
7.652613932506983